include/GLANGSoapBinding.oligomer_counter.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://soap.g-language.org/GLANG">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:oligomer_counter>
   <sequence></sequence>
   <oligomer></oligomer>
   <params>
    <window>0</window>
   </params>
  </ns1:oligomer_counter>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
